# 붓꽃 구별하기. 머신러닝 프로젝트1 --> Iris

from sklearn.neighbors import KNeighborsClassifier
from sklearn import metrics
from sklearn.utils import shuffle
import pandas as pd

'''
    준비
    0. 데이터 준비   : 학습용, 테스트용 => 지도학습(데이터 들, 레이블)
        훈련용, 학습용으로 분리 (8:2)

    1. 머신러닝 알고리즘 선택(Knn, SVM, 의사결정트리... + 딥러닝 가능)

    2. 학습데이터(80%)로 훈련시키기 => 오래 걸리는 작업 (좋은 컴퓨터 + GPU)
        ==> 모델이 완성됨  
    3. <모의고사>모델의 정답률(신뢰도) : 테스트용 데이터(20%) ==> 몇%가 일치한지 여부
'''

'''
    4. 정답을 모르는 데이터로 예측 해 보기 : 최종 목표
    
'''
# 손글씨 숫자 구별하기. 머신러닝 프로젝트 3  --> MNIST
from sklearn.neighbors import KNeighborsClassifier
from sklearn.svm import SVC, SVR, NuSVC, NuSVR
from sklearn import utils, metrics
import pandas as pd

# 0. 데이터를 준비 : 학습용, 테스트용  --> 지도학습 (데이터 들, 레이블)
study_df = pd.read_csv('DATA/train_5k.csv')
print(study_df)
#study_df = utils.shuffle(study_df)
test_df = pd.read_csv('DATA/train_1k.csv')
#test_df = utils.shuffle(test_df)

# 훈련용, 학습용으로 분리 (8:2)
studySize = study_df.shape[0]
testSize = test_df.shape[0]

study_data = study_df.iloc[0:studySize, 1: ]
study_label = study_df.iloc[0:studySize, [0] ]

test_data = test_df.iloc[0:testSize, 1: ]
test_label = test_df.iloc[0:testSize, [0] ]
# 1. 머신러닝 알고리즘 선택 (Knn, SVM, 의사결정트리 ..... + 딥러닝도 가능)
clf = KNeighborsClassifier(n_neighbors=3)
#clf = SVC(gamma='auto')

# 2. 학습데이터로 훈련시키기 ---> 오래 걸리는 작업 (좋은 컴퓨터 + GPU)
#    ---> 모델이 완성됨!
clf.fit( study_data, study_label )
# 3.<모의고사> 모델의 정답률(신뢰도) : 테스트용(20%) 데이터 --> 몇% 맞추니?
answers = clf.predict(test_data)
score = metrics.accuracy_score(answers, test_label) * 100
print('정답률 : %5.2f %%' % (score))

# (4. 정답을 모르는 데이터로 예측해 보기 : 이게 최종 목표 )
answer = clf.predict([ [ 0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,3,18,18,18,126,136,175,26,166,255,247,127,0,0,0,0,0,0,0,0,0,0,0,0,30,36,94,154,170,253,253,253,253,253,225,172,253,242,195,64,0,0,0,0,0,0,0,0,0,0,0,49,238,253,253,253,253,253,253,253,253,251,93,82,82,56,39,0,0,0,0,0,0,0,0,0,0,0,0,18,219,253,253,253,253,253,198,182,247,241,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,80,156,107,253,253,205,11,0,43,154,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,14,1,154,253,90,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,139,253,190,2,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,11,190,253,70,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,35,241,225,160,108,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,81,240,253,253,119,25,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,45,186,253,253,150,27,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,16,93,252,253,187,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,249,253,249,64,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,46,130,183,253,253,207,2,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,39,148,229,253,253,253,250,182,0,0,0,77,0,0,0,0,0,55,0,0,0,0,0,0,0,0,24,114,221,253,253,253,253,201,78,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,23,66,213,180,253,253,22,198,81,2,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,18,171,219,253,253,253,253,195,80,9,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,55,172,226,253,253,253,253,244,133,11,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,136,253,253,253,212,135,132,16,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0]    ])
print('이 글은', answer, ' 입니다.', '단,', score , '%의 확률입니다.')